Repository: abeek1/61439-3_2024
Catalog: tm/EVS-EN_61439-1_2021/EVS-EN_61439-1_2021_9_Performance requirements _9 TOIMIVUSNÕUDED .tmx
Source language: en
Languages: et

source: 9 Performance requirements
et: 9 TOIMIVUSNÕUDED 9.1 Dielektrilised omadused

source: 9.1 Dielectric properties
et: 9.1.1 Üldnõuded

source: 9.1.1 General
et: Kooste iga ahel peab olema võimeline taluma

source: Each circuit of the assembly shall be capable of withstanding:
et: — ajutisi liigpingeid,

source: – temporary overvoltages; – transient overvoltages.
et: — transientliigpingeid.

source: The ability to withstand temporary overvoltages, and the integrity of solid insulation, is verified by the power-frequency withstand voltage and the ability to withstand transient overvoltages is verified by the impulse withstand voltage.
et: Ajutiste liigpingete talumisvõimet ja tahke isolatsiooni terviklikkust kontrollitakse võrgusagedusliku taluvuspingega ning transientliigpingete talumisvõimet kontrollitakse impulsstaluvuspingega.

source: In the case of variable frequency drives or converters, reflected voltage waves, recurring peak voltages and frequency can require special attention.
et: Muutuva sagedusega ajamid või muundurid, peegeldunud pingelained, korduvad tipp-pinged ja nende sagedus võivad nõuda eritähelepanu.

source: ˜NOTE
et: ˜MÄRKUS

source: IEC 60664-1:2007 contains the requirements for supplementary and reinforced insulation (Class II).™
et: IEC 60664-1:2007 sisaldab nõudeid lisaisolatsioonile ja tugevdatud isolatsioonile (klass II).™

source: 9.1.2 Power-frequency withstand voltage
et: 9.1.2 Võrgusageduslik taluvuspinge

source: The circuits of the assembly shall be capable of withstanding the appropriate power-frequency withstand voltages given in Table 8 and Table 9 (see 10.9.2).
et: Kooste ahelad peavad olema võimelised taluma tabelites 8 ja 9 (vt jaotis 10.9.2) esitatud asjakohaseid võrgusageduslikke taluvuspingeid.

source: The rated insulation voltage of any circuit of the assembly shall be equal to or higher than its maximum rated operational voltage.
et: Kooste iga ahela isolatsiooni tunnuspinge peab vähemalt võrduma ahela suurima tunnus-talitluspingega.

source: Enclosures and external operating handles manufactured from or covered with insulating materials shall be capable of withstanding the power frequency dielectric tests as given in 10.9.4 and 10.9.5.
et: Isoleermaterjalist valmistatud või sellega kaetud ümbrised ja välised talitluskäepidemed peavad olema võimelised taluma jaotistes 10.9.4 ja 10.9.5 esitatud võrgusageduslikke dielektrilisi katsetusi.

source: Conductors covered with insulating material to provide protection against electric shock shall be capable of withstanding the power frequency dielectric test as given in 10.9.6.
et: Juhid, mis on kaetud isoleermaterjaliga, et tagada kaitse elektrilöögi eest, peavad olema võimelised taluma jaotises 10.9.6 esitatud võrgusageduslikku dielektrilist katsetust.

source: This test is not required for insulated conductors which are verified to be suitably insulated according to their product standard (e.g. cables).
et: Seda katsetust ei nõuta isoleeritud juhtide (nt kaablite) puhul, mille sobivat isolatsiooni on kontrollitud nende tootestandardite järgi.

source: 9.1.3 Impulse withstand voltage
et: 9.1.3 Impulsstaluvuspinge

source: 9.1.3.1 Impulse withstand voltages of main circuits
et: 9.1.3.1 Peaahelate impulsstaluvuspinge

source: Clearances from live parts to exposed-conductive-parts and between live parts of different potential shall be capable of withstanding the test voltage given in Table 10 as appropriate for the rated impulse withstand voltage.
et: Pingestatud osade ja pingealdiste juhtivate osade vahelised ning pingestatud eri potentsiaaliga osade vahelised õhkvahemikud peavad olema võimelised taluma asjakohasele tunnus-impulsstaluvuspingele vastavat tabelis 10 esitatud teimipinget.

source: The rated impulse withstand voltage for a given rated operational voltage shall not be less than that corresponding in Annex G to the type of supply system and the nominal voltage of the supply system of the circuit at the point where the assembly is to be used and the appropriate overvoltage category.
et: Antud tunnus-talitluspingele vastav tunnus-impulsstaluvuspinge ei tohi olla madalam kui lisas G esitatud elektrivarustussüsteemi liigile vastav pinge ja ahela toitesüsteemi nimipinge kohas, kus koostet kasutatakse, ja asjakohane liigpingekategooria.

source: 9.1.3.2 Impulse withstand voltages of auxiliary circuits
et: 9.1.3.2 Abiahelate impulsstaluvuspinged

source: a) Auxiliary circuits that are connected to the main circuit and operate at the rated operational voltage without any means for reduction of overvoltage shall comply with the requirements of 9.1.3.1.
et: a) Peaahelaga ühendatud ja tunnus-talitluspingel talitlevad abiahelad, milles ei ole rakendatud liigpinget piiravaid meetmeid, peavad vastama jaotise 9.1.3.1 nõuetele.

source: b) Auxiliary circuits that are not connected to the main circuit may have an overvoltage withstand capacity different from that of the main circuit.
et: b) Abiahelatel, mis ei ole peaahelaga ühendatud, võib olla peaahelast erinev liigpingetaluvusvõime.

source: The clearances of such circuits – AC or DC – shall be capable of withstanding the appropriate impulse withstand voltage in accordance with Annex G.
et: Niisuguste ahelate vahelduv- või alalispinge jaoks ette nähtud õhkvahemikud peavad olema võimelised taluma asjakohast lisaga G kooskõlas olevat impulsstaluvuspinget.

source: 9.1.4 Protection of surge protective devices
et: 9.1.4 Liigpingepiirikute kaitse

source: When overvoltage conditions require surge protective devices (SPDs) to be connected to the main circuit, such SPDs shall be protected to prevent uncontrolled short-circuit conditions as specified by the SPD manufacturer.
et: Kui liigpingeolud nõuavad peaahelaga ühendatud liigpingepiirikuid, tuleb neid kaitsta kontrollimatute lühiseolukordade vältimise teel, nagu selle on sätestanud liigpingepiiriku tootja.

source: The installation of the SPD needs to respect the instructions of the SPD manufacturer, for example, the total length of conductors between the terminals of the SPD to the line and earth, as applicable.
et: Liigpingepiiriku paigaldamine vajab liigpingepiiriku tootja juhiste tunnustamist, näiteks juhtide kogupikkuse arvestamist liigpingepiiriku klemmide ning faasi ja maa vahel, nagu see on rakendatav.

source: 9.2 Temperature-rise limits
et: 9.2 Ületemperatuuri piirangud

source: 9.2.1 General
et: 9.2.1 Üldnõuded

source: The assembly and its circuits shall be able to carry their rated currents under specified conditions (see 5.3.1, 5.3.2, 5.3.3 and 5.4), taking into consideration the ratings of the components, their disposition and application, without exceeding the limits given in Table 6 when verified in accordance with 10.10.
et: Kooste ja selle ahelad peavad olema võimelised sätestatud oludes (vt jaotised 5.3.1, 5.3.2, 5.3.3 ja 5.4), võttes arvesse komponentide tunnusandmeid, nende paigutust ja rakendust, taluma nende sätestatud tunnusvoolusid tabelis 6 esitatud piiranguid ületamata, kui neid on kontrollitud vastavalt jaotisele 10.10.

source: The temperature-rise limits given in Table 6 apply for a daily average ambient air temperature of 35 °C.
et: Ületemperatuuri piirväärtused, mis on esitatud tabelis 6, kehtivad ümbruse keskmisel ööpäevasel õhutemperatuuril 35 °C.

source: The temperature-rise of an element or part is the difference between the temperature of this element or part measured in accordance with 10.10.2.3.3 and the ambient air temperature outside the assembly.
et: Elemendi või osa ületemperatuur on vastava elemendi või osa jaotise 10.10.2.3.3 kohaselt mõõdetud temperatuuri ja koostet ümbritseva õhu temperatuuri vahe.

source: If the mean ambient air temperature is higher than 35 °C, then the temperature-rise limits shall be adapted for this special service condition, so that the sum of the ambient air temperature and the individual temperature-rise limit remains the same.
et: Kui ümbruse keskmine temperatuur on kõrgem kui 35 °C, tuleb ületemperatuuri piiranguid kohaldada selles eritalitlusolus selliselt, et ümbrustemperatuuri ja üksiku lubatava ületemperatuuri summa jääks samaks.

source: If the daily average ambient air temperature is lower than 35 °C, the same adaptation of the temperature-rise limits is allowed subject to agreement between the user and the assembly manufacturer.
et: Kui keskmine ümbrustemperatuur on madalam kui 35 °C, lubatakse samasugust lubatava ületemperatuuri kohaldamist vastavalt kooste kasutaja ja tootja kokkuleppele.

source: In some cases, for example, manual operating means, accessible external covers and enclosures, higher temperatures are permitted, but not higher than maximum limits from Table 6.
et: Mõningatel juhtumitel, näiteks käsijuhtimisvahendite kasutamisel, võib lubada puutevõimalike väliskatete ja ümbriste kõrgemat temperatuuri, kuid mitte kõrgemat kui kõrgeimad piirväärtused tabelis 6.

source: See Table 6, footnote h.
et: Vt tabeli 6 joonealune märkus h.

source: The temperature-rise shall not cause damage to current-carrying parts or adjacent parts of the assembly.
et: Ületemperatuur ei tohi põhjustada kooste voolujuhtivate osade ega nendega külgnevate osade kahjustamist.

source: In particular, for insulating materials, the original manufacturer shall demonstrate compliance either by reference to the temperature index, for example, by the methods of IEC 60216 (all parts) or in accordance with IEC 60085:2007.
et: Eriti peab kooste esmatootja näitama isoleermaterjalide sobivust kas viitega isolatsiooni temperatuuriindeksile näiteks standardisarja IEC 60216 meetodite järgi või vastavuses standardiga IEC 60085:2007.

source: 9.2.2 Adjustment of rated currents for alternative ambient air temperatures If the temperature-rise limits have been changed to cover a different ambient air temperature, then the rated currents of all busbars, functional units, etc. may need to be changed accordingly.
et: 9.2.2 Tunnusvoolude täpsustamine ümbruse alternatiivse õhutemperatuuri korral Kui ületemperatuuri piiranguid on muudetud vastavalt ümbruse teistsugusele õhutemperatuurile, võib olla vajalik vastavalt muuta kõigi kogumislattide, funktsionaalühikute jne tunnusvoolusid.

source: The original manufacturer shall state the measures to be taken, if any, to ensure compliance with the temperature limits.
et: Esmatootja peab kehtestama rakendatavad meetmed, kui need on vajalikud, et tagada vastavus temperatuuripiirangutele.

source: If an adaptation for lower ambient air temperatures is made, then the rated currents of the devices published by the device manufacturers shall not be exceeded.
et: Ümbruse madalama temperatuuriga kohandamisel ei tohi ületada seadiste tunnusvoolusid, mille on avaldanud seadise tootja.

source: If a temperature-rise test has been previously carried out applying the temperature-rise limits for a daily average ambient air temperature of 35 °C, then, up to a daily average ambient air temperature of 50 °C, the rated currents verified by test can be adjusted by calculation as given in 10.10.3.6.
et: Kui ületemperatuurikatsetus on varem sooritatud, rakendades ületemperatuuripiiranguid ümbruse ööpäevase keskmise õhutemperatuuri 35 °C korral, võib ümbruse ööpäevase keskmise õhutemperatuuri kuni 50 °C katsetusega kontrollitud tunnusvoolusid täpsustada arvutustega, nagu need on esitatud jaotises 10.10.3.6.

source: 9.3 Short-circuit protection and short-circuit withstand strength
et: 9.3 Lühisekaitse ja lühisetaluvus

source: 9.3.1 General
et: 9.3.1 Üldnõuded

source: Assemblies shall be capable of withstanding the thermal and dynamic stresses resulting from short-circuit currents not exceeding the rated values.
et: Koosted peavad olema võimelised taluma lühisvooludest tingitud soojuslikke ja dünaamilisi toimeid, mis ei ületa tunnusväärtusi.

source: NOTE 1
et: MÄRKUS 1

source: The short-circuit stresses can be reduced by the use of current-limiting devices, e.g. inductance, currentlimiting fuses or other current-limiting switching devices.
et: Lühisvooludest tingitud toimeid saab vähendada voolupiiravate seadmete, nt induktiivsuste, voolupiiravate sulavkaitsmete või muude voolupiiravate lülitusseadiste abil.

source: NOTE 2
et: MÄRKUS 2

source: When a short-circuit results from the operation of arc quenching device (AQD) according to IEC 60947-91 or any other intentional short-circuiting device, this results in the maximum stress on the circuits concerned.
et: Kui lühis tekitatakse standardile IEC 60947-9-1 vastava kaarekõrvaldamisseadise rakendumise või muu tahtliku lühistamise seadise rakendumise teel, tuleneb sellest mõjutatavate ahelate suurim liigkoormus.

source: Assemblies shall be protected against short-circuit currents by means of, for example, circuitbreakers, fuses or combinations of both, which may either be incorporated in the assembly or arranged outside of it.
et: Koosteid tuleb lühisvoolude eest kaitsta näiteks kaitselülitite, sulavkaitsmete või nende kombinatsiooniga, mis võivad olla koostesse sisse ehitatud või asuda väljaspool koostet.

source: For assemblies intended for use in IT systems, the short-circuit protective device should have a sufficient breaking capacity on each single pole at line-to-line voltage to clear a double earth fault.
et: Koostete puhul, mis on ette nähtud kasutamiseks IT-süsteemides, peab lühisekaitseaparaadi igal üksikpoolusel olema faasidevahelisel pingel piisav lahutusvõime kaksikmaalühise väljalülitamiseks.

source: (See IEC 60364-5-53:2001, IEC 60364-5-53:2001/AMD1:2002 and IEC 60364-553:2001/AMD2:2015).
et: (Vt standardid IEC 60364-5-53:2001, IEC 60364-5-53:2001/AMD1:2002 ja IEC 60364-5-53:2001/AMD2:2015).

source: Unless otherwise specified in the assembly manufacturer’s operating and maintenance instructions, assemblies that have been subjected to a short-circuit may not be suitable for future service without inspection and/or maintenance by skilled person(s).
et: Kui kooste tootja ei ole koostete talitlus- ja hooldusjuhistes määranud teisiti, võib lühisvoolude toime all olevate koostete edasine talitlus ilma elektrialaisiku(te) ülevaatuse ja/või hoolduseta olla ebapiisav.

source: 9.3.2 Information concerning short-circuit withstand strength
et: 9.3.2 Teave lühisetaluvuse kohta

source: For assemblies with a SCPD incorporated in the incoming unit, the assembly manufacturer shall declare the maximum allowable value of the prospective short-circuit current at the input terminals of the assembly.
et: Sisendühikusse sisse ehitatud lühisekaitseaparaadiga koostete puhul peab kooste tootja deklareerima arvutusliku lühisvoolu enimalt lubatava väärtuse kooste sisendklemmidel.

source: This value shall not exceed the appropriate rating(s) (see 5.3.4, 5.3.5, and 5.3.6).
et: See väärtus ei tohi ületada vastava(te) tunnussuurus(t)e väärtust (väärtusi) (vt jaotised 5.3.4, 5.3.5 ja 5.3.6).

source: The corresponding power factor and peak values shall be those shown in 9.3.3.
et: Sellekohane võimsustegur ja tippväärtused peavad vastama jaotisele 9.3.3.

source: If a circuit-breaker with a time-delay release is used as the short-circuit protective device, the assembly manufacturer shall state the maximum time-delay and the current setting corresponding to the indicated prospective short-circuit current.
et: Kui lühisekaitseaparaadina kasutatakse viitega rakenduvat kaitselülitit, peab kooste tootja ette andma esitatud arvutuslikule lühisvoolule vastava pikima viite ja voolusätte.

source: For assemblies where the short-circuit protective device is not incorporated in the incoming unit, the assembly manufacturer shall indicate the short-circuit withstand strength in one or both of the following ways:
et: Koostete puhul, mille lühisekaitseaparaat ei paikne sisendühikus, peab kooste tootja esitama lühisetaluvusandmed ühel või mõlemal alljärgneval viisil:

source: a) rated short-time withstand current (Icw) together with the associated duration (see 5.3.5) and rated peak withstand current (Ipk) (see 5.3.4);
et: a) lühiajaline tunnus-taluvusvool (Icw) ja selle kestus (vt jaotis 5.3.5) ning tunnus-lööktaluvusvool (Ipk) (vt jaotis 5.3.4);

source: b) rated conditional short-circuit current (Icc) including the current-limiting characteristics of the upstream SCPD (see 3.1.11).
et: b) tinglik tunnus-lühisvool (Icc) koos toitepoolse lühisekaitseaparaadi (vt termin 3.1.11) voolupiiramisandmetega.

source: For times up to a maximum of 3 s, the relationship between the rated short-time current and the associated duration is given by the formula I2t = constant, provided that the peak value does not exceed the rated peak withstand current.
et: Kestusel kuni 3 s on suurima lühiajalise tunnus-taluvusvoolu ja selle kestuse vaheline sõltuvus määratud valemiga I2t = const eeldusel, et löökvool ei ületa tunnus-lööktaluvusvoolu väärtust.

source: For an assembly having several incoming units which are unlikely to be in operation simultaneously, the short-circuit withstand strength can be indicated for each of the incoming units in accordance with the above.
et: Mitme sisendühikuga kooste puhul, mille sisendühikute üheaegne talitlus ei ole tõenäoline, võib lühisetaluvuse näidata vastavalt eeltoodule iga sisendühiku kohta eraldi.

source: For an assembly having several incoming units which are likely to be in operation simultaneously, and for an assembly having one incoming unit and one or more outgoing highpower units likely to contribute to the short-circuit current, it is necessary to determine the values of the prospective short-circuit current, considering all operating modes, in each incoming unit, in each outgoing unit and in the busbars.
et: Mitme sisendühikuga kooste puhul, mille sisendühikud võivad talitleda ühel ajal, ning kooste puhul, millel on üks sisendühik ja üks või mitu suure võimsusega väljundühikut, mis võivad mõjutada lühisvoolu, on vaja määrata kõiki talitlusviise, arvestades iga sisendühiku, iga väljundühiku ning kogumislattide arvutusliku lühisvoolu väärtusi.

source: The prospective short-circuit currents determined shall be based on data provided by the user.
et: Määratud arvutuslikud lühisvoolud peavad põhinema kasutaja esitatud andmetel.

source: 9.3.3 Relationship between peak current and short-time current
et: 9.3.3 Löökvoolu ja lühiajalise voolu vaheline seos

source: For determining the electrodynamic stresses, the value of peak current shall be obtained by multiplying the RMS value for AC applications and mean value for DC applications of the shortcircuit current by the factor n.
et: Elektrodünaamiliste liigkoormuste määramiseks tuleb löökvool arvutada lühisvoolu vahelduvvoolurakenduste efektiivväärtuse või alalisvoolurakenduste keskväärtuse korrutisena teguriga n.

source: The values for the factor n and the corresponding power factor for AC applications are given in Table 7.
et: Teguri n väärtused ja vahelduvvoolurakenduste asjakohane võimsustegur on esitatud tabelis 7.

source: The peak factor for DC applications is subject to agreement between the manufacturer and the user.
et: Alalisvoolurakenduste lööktegur on tootja ja kasutaja vahelise kokkuleppe aines.

source: NOTE For DC applications, if the user has not stated a peak current value, the value of n = 1,42 is typically used.
et: MÄRKUS Alalisvoolurakenduste puhul, kui kasutaja ei ole määranud löökvoolu väärtust, kasutatakse tüüpiliselt väärtust n = 1,42.

source: 9.3.4 Coordination of protective devices
et: 9.3.4 Kaitseaparaatide koordineerimine

source: The coordination of protective devices within the assembly with those to be used externally to the assembly shall be the subject of an agreement between the assembly manufacturer and the user.
et: Koostesiseste kaitseaparaatide koordineerimine väljaspool koostet asuvate kaitseaparaatide suhtes peab olema kooste tootja ja kasutaja vahel kokku lepitud.

source: Information given in the assembly manufacturer's catalogue may take the place of such an agreement.
et: Sellise kokkuleppena võib arvestada ka tootja kataloogides esitatavaid andmeid.

source: If the operating conditions require maximum continuity of supply, the settings or selection of the short-circuit protective devices within the assembly should, where possible, be so coordinated that a short-circuit occurring in any outgoing circuit is cleared by the SCPD installed in the circuit without affecting the other outgoing circuits, thus ensuring selectivity of the protective system.
et: Kui talitlusolud nõuavad kindlaimat pidevat energiavarustust, tuleb koostesiseste lühisekaitseaparaatide sätted või valik koordineerida võimalust mööda selliselt, et kooste mingi väljundi lühise lülitab välja selle väljundi lüliti, mõjutamata teisi väljundeid, tagades seega kaitse selektiivsuse.

source: Where short-circuit protective devices are connected in series and are intended to operate simultaneously to reach the required short-circuit switching capability (i.e. back-up protection), the assembly manufacturer shall inform the user (e.g. by a warning label in the assembly or in the operating instructions, see 6.2) that none of the protective devices are allowed to be replaced by another device which is not of identical type and rating, unless the device is tested and approved in combination with the back-up device since the switching capability of the whole combination can otherwise be compromised.
et: Kui lühisekaitseaparaadid on lülitatud jadamisi ja on lühisvoolu nõutava lahutusvõime tagamiseks ette nähtud üheaegseks talitluseks (s.t varukaitset sisaldava süsteemina), peab kooste tootja teavitama kasutajat (nt koostel paikneva hoiatussildiga või talitlusjuhendis, vt jaotis 6.2), et ühtegi kaitseaparaati ei tohi asendada mingi teist liiki või teistsuguste tunnusandmetega aparaadiga, väljaarvatult juhtumil, mil aparaati on katsetatud ja heaks kiidetud kombinatsioonis koos varukaitsega, sest muidu võib kaduda kogu aparaadikombinatsiooni lülitusvõime.

source: Further guidance is given in IEC TR 61912-1:2007 and IEC TR 61912-2:2009.
et: Lisajuhised on esitatud dokumentides IEC TR 61912-1:2007 ja IEC TR 61912-2:2009.

source: See also 8.5.3.
et: Vt ka jaotis 8.5.3.

source: 9.4 Electromagnetic compatibility (EMC)
et: 9.4 Elektromagnetiline ühilduvus

source: For EMC-related performance requirements, see J.9.4.
et: Elektromagnetilise ühilduvusega seotud toimivusnõuded on esitatud jaotises J.9.4.
